Revit 2024 API
TessellatedBuildIssueType Enumeration
 Types of issues encountered while constructing geometrical objects from the tessellatted face sets.
 Issues, which can be encountered while building a polymesh, or a shell, or a solid from data, describing tessellated shapes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum TessellatedBuildIssueType
Visual Basic
Public Enumeration TessellatedBuildIssueType
Visual C++
public enum class TessellatedBuildIssueType
Members
Member name | Description
AllFine |  No issues were encountered. Issues of this type should not be present in TessellatedShapeBuilderResult.
EmptyFace |  A face which does not have any loops. An associated number is face index.
EmptyLoop |  A face loop which does not have any points. Associated numbers are face index and loop index respectively.
TooFewOriginalVertices |  A face loop, which from the very beginning does not have enough points. Associated numbers are face index and loop index respectively.
TooShortOriginalLoopMeshSegment |  A face loop, containing a segment which is too short even for a mesh. Associated numbers are face, loop and point indices respectively (the segment goes from the previous point to this one).
TooShortOriginalLoopGeomSegment |  A face loop, containing a segment which is too short for a geometry, but not for a mesh. Associated numbers are face, loop and point indices respectively (the segment goes from the previous point to this one).
LostTooManyLoopVertices |  A face loop, which originally had enough vertices, but lost too many of them, while purging pseudo-duplicates. Associated numbers are face index and loop index respectively.
OriginalLoopGeomAcuteAngle |  A face loop with a too acute angle between adjacent segments. This condition is not relevant for polymesh construction. Associated numbers are face, loop and point between segments indices respectively.
OriginalLoopMeshAcuteAngle |  A face loop with a too acute angle between adjacent segments. This condition is not relevant for polymesh construction. Associated numbers are face, loop and point between segments indices respectively.
LostAllLoops |  A face, which originally had enough loops lost all of them during purges. An associated number is face index.
NonPlanarFace |  A face which is not planar. An associated number is face index.
OriginalPointsTooFarFromTheirPlane |  A face whose original points taken together do define a plane, but some of them lie to far from it. An associated number is face index.
TooSmallVertexSegementDistInOriginalLoop |  A face loop with too small vertex-segment distance. Associated numbers are face, loop, segment and vertex indices respectively.
LoopOnBestFitSelfIntersects |  A face loop whose projection of the best-fit-plane self-intersects. Associated numbers are face, loop, and two segments indices respectively.
IntersectingOriginalLoops |  A face whose loops intersect. Associated numbers are face and two loop indices respectively.
FaceWithIslands |  A face which has a loop inside a loop inside a loop. Associated numbers are face and three loop indices respectively.
OriginalLoopsProximity |  A face with excessive proximity between face loops. Associated numbers are face and two loop indices respectively.
OuterLoopIsNotFirst |  A face have multiple loops, but the outer loop is not listed as the very first one. Associated numbers are face and loop indices respectively.
DegenOriginalLoop |  A degenerate face loop is degenerate. Associated numbers are face and loop indices respectively.
InconsistentInnerOuterOriginalLoopCCW |  A face where the CCW of inner loop is inconsistent with CCW of the outer loop. Associated numbers are face and inner loop indices respectively.
EdgeTwiceUsedByFace |  A face with an edge encountered in the loops multiple times. Associated numbers are face and loop in which the problem became obvious indices respectively.
NonManifoldEdge |  Same edge is used by more than two faces. This issue can be posted for topologically impossible face sets as well as for face sets with duplicate faces. Associated numbers are face and loop in which the problem became obvious indices respectively.
OverlappingAdjacentFaces |  Adjacent faces which either exactly overlaps or have a too acute angle between them. This issue can be reported for face sets with duplicate faces as well. Associated numbers are face and loop indices of one face and face and loop indices of another face respectively.
PartitionPointsTooFarFromTrueEdge |  Points representing partitions of input points are too far from the true edge. Associated numbers are face and loop indices, an index of the vertex in the beginning of the segment which is too far from the corresponding true edge, an index of another involved face respectively.
EdgeTraversalForFlip |  A face edge with topological problems. Associated numbers are indices of the face, loop and vertex and an index of another involved face respectively.
InconsitentMultiEdgeTraversalForFlip |  A face edge with topological problems. Associated numbers are indices of the involved faces.
TooSmallVertexSegementDistInFinalLoop |  A face loop with too small vertex-segment distance. Associated numbers are face, loop, segment and vertex indices respectively
InternalUtilityError |  An internal Revit problem. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered.
InternalError |  An internal Revit problem. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered. Associated number is face index.
InternalLightError |  An internal Revit problem. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered. Associated number is face index.
InternalMissingError |  An internal Revit problem. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered. Associated number is face index.
UnarticulatedNonManifoldEdge |  An input face is mising an edge conecting two non-adjacent vertices from its boundaries, which are adjacent in the boundaries of some other face(s). If such an edge would be added, it would split the face and result in 'NonManifoldEdge' or other issues. Associated numbers are indices of a face which misses an edge and indices of one or two faces in which boundaries such edge is present.
NotSetYet |  An issue has not been set yet.
NumberOfIssueTypes |  Not a code of some issue, but the number of known types of issues. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered
See Also
Autodesk.Revit.DB Namespace